# RiserHeightIsTooSmall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RiserHeightIsTooSmall Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Riser height is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RiserHeightIsTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RiserHeightIsTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RiserHeightIsTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace